/*
 * Вариант #3
 * Необходимо написать программу, используя знания, полученные в лабораторной работе №5.
 * Потоки должны быть синхронизированы для выполнения поставленной задачи или код должен выполнять задачи последовательно.
 * Создать симулятор рынка с минимум 3 торговцами.
 * Торговцы обслуживают по одному человеку в очереди,
 * а после того, как очередь закончилась – начинаю обслуживать людей в очередях других торговцев.
 */

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello World!\n";

    return 0;
}
