/* 
 * Вариант #5
 * Создать консольную программу для работы с базой данных. 
 * Программа должна уметь выводить в консоль данные из БД,
 * записывать новые данные, а также редактировать и удалять уже существующие. 
 */

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
